Repository: dropxhq/paper-loop
Catalog: paper-loop/paper-loop/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, ko, zh_hant

source: AI 设置
en: AI Settings
ja: AI設定
ko: AI 설정
zh_hant: AI 設定

source: API 凭据
en: API Credentials
ja: API認証情報
ko: API 자격증명
zh_hant: API 憑據

source: arXiv · PDF · 自动卡片
en: arXiv · PDF · Auto Cards
ja: arXiv · PDF · 自動カード
ko: arXiv · PDF · 자동 카드
zh_hant: arXiv · PDF · 自動卡片

source: Base URL（留空使用默认）
en: Base URL (leave blank for default)
ja: ベースURL（空白でデフォルト使用）
ko: Base URL (비워두면 기본값 사용)
zh_hant: Base URL（留空使用預設）

source: DashScope 用户：语音朗读与卡片生成可使用同一 Key
en: DashScope users: the same key works for TTS and card generation.
ja: DashScopeユーザー：TTSとカード生成に同じキーが使えます。
ko: DashScope 사용자: TTS와 카드 생성에 동일한 키를 사용할 수 있습니다.
zh_hant: DashScope 用戶：語音朗讀與卡片生成可使用同一 Key

source: DashScope 语音
en: DashScope Voice
ja: DashScope音声
ko: DashScope 음성
zh_hant: DashScope 語音

source: 不认识
en: Again
ja: わからない
ko: 모름
zh_hant: 不認識

source: 今日复习
en: Today's Reviews
ja: 今日の復習
ko: 오늘 복습
zh_hant: 今日複習

source: 今日复习已完成
en: All Caught Up!
ja: 今日の復習が完了しました
ko: 오늘 복습 완료!
zh_hant: 今日複習已完成

source: 你可以查看已有词卡、追加新词卡合并，或删除旧词卡重新生成。
en: View existing cards, merge new ones, or delete and regenerate.
ja: 既存のカードを確認、追加マージ、または削除して再生成できます。
ko: 기존 카드 보기, 새 카드 병합, 또는 삭제 후 재생성할 수 있습니다.
zh_hant: 你可以查看已有詞卡、追加新詞卡合併，或刪除舊詞卡重新生成。

source: 使用 PDF 解析中…
en: Parsing PDF…
ja: PDFを解析中…
ko: PDF 분석 중…

source: 例句
en: Example
ja: 例文
ko: 예문

source: 保存
en: Save
ko: 저장
zh_hant: 儲存

source: 保存设置
en: Save Settings
ja: 設定を保存
ko: 설정 저장
zh_hant: 儲存設定

source: 入口
en: Source
ja: 入力
ko: 소스

source: 全选
en: Select All
ja: すべて選択
ko: 모두 선택
zh_hant: 全選

source: 全部
en: All
ja: すべて
ko: 전체

source: 出现记录
en: Occurrences
ja: 登場箇所
ko: 등장 위치
zh_hant: 出現記錄

source: 删除
en: Delete
ja: 削除
ko: 삭제
zh_hant: 刪除

source: 删除 %lld 张词卡？
en: Delete %lld cards?
ja: %lld枚のカードを削除しますか？
ko: 카드 %lld개를 삭제하시겠습니까?
zh_hant: 刪除 %lld 張詞卡？

source: 删除并重新导入
en: Delete and Re-import
ja: 削除して再インポート
ko: 삭제 후 다시 가져오기
zh_hant: 刪除並重新匯入

source: 前往阿里云百炼获取 API Key →
en: Get your API Key from Alibaba Cloud →
ja: アリクラウドでAPIキーを取得 →
ko: Alibaba Cloud에서 API 키 받기 →
zh_hant: 前往阿里雲百煉取得 API Key →

source: 加载中...
en: Loading...
ja: 読み込み中...
ko: 로딩 중...
zh_hant: 載入中...

source: 单词
en: Word
ja: 単語
ko: 단어
zh_hant: 單詞

source: 取消
en: Cancel
ja: キャンセル
ko: 취소

source: 取消全选
en: Deselect All
ja: すべて解除
ko: 모두 선택 해제
zh_hant: 取消全選

source: 句
en: S
ja: 文
ko: 문

source: 句子
en: Sentence
ja: 例文
ko: 예문

source: 合并（追加新词卡）
en: Merge (Append New Cards)
ja: マージ（新しいカードを追加）
ko: 병합 (새 카드 추가)
zh_hant: 合併（追加新詞卡）

source: 回到原文
en: Back to Source
ja: 原文へ戻る
ko: 원문으로 돌아가기

source: 复习
en: Review
ja: 復習
ko: 복습
zh_hant: 複習

source: 字体大小
en: Font Size
ja: フォントサイズ
ko: 글꼴 크기
zh_hant: 字體大小

source: 学习统计
en: Learning Stats
ja: 学習統計
ko: 학습 통계
zh_hant: 學習統計

source: 完成
en: Done
ja: 完了
ko: 완료

source: 导入
en: Import
ja: インポート
ko: 가져오기
zh_hant: 匯入

source: 导入成功！
en: Import successful!
ja: インポート完了！
ko: 가져오기 성공!
zh_hant: 匯入成功！

source: 导入日期
en: Imported
ja: インポート日
ko: 가져온 날짜
zh_hant: 匯入日期

source: 导入来源
en: Import Source
ja: インポート元
ko: 가져오기 소스
zh_hant: 匯入來源

source: 导入论文
en: Import Paper
ja: 論文をインポート
ko: 논문 가져오기
zh_hant: 匯入論文

source: 导入论文，自动生成可复习词卡
en: Import Papers, Auto-Generate Flashcards
ja: 論文をインポートして自動でフラッシュカードを生成
ko: 논문 불러와 플래시카드 자동 생성
zh_hant: 匯入論文，自動生成可複習詞卡

source: 导入论文后，词汇将自动出现在这里
en: Vocabulary will appear here after importing a paper.
ja: 論文をインポートすると単語がここに表示されます。
ko: 논문을 가져온 후 단어가 여기에 표시됩니다.
zh_hant: 匯入論文後，詞彙將自動出現在這裡

source: 已保存 ✓
en: Saved ✓
ja: 保存済み ✓
ko: 저장됨 ✓
zh_hant: 已儲存 ✓

source: 已导入论文
en: Imported Papers
ja: インポート済み論文
ko: 가져온 논문
zh_hant: 已匯入論文

source: 已掌握
en: Mastered
ja: 習得済み
ko: 숙달됨

source: 已配置 · 点击修改
en: Configured · Tap to edit
ja: 設定済み · タップして変更
ko: 설정됨 · 탭하여 수정
zh_hant: 已設定 · 點擊修改

source: 当前：%@
en: Current: %@
ja: 現在：%@
ko: 현재: %@
zh_hant: 目前：%@

source: 我的
en: Profile
ja: マイページ
ko: 내 정보

source: 搜索词汇
en: Search vocabulary
ja: 単語を検索
ko: 단어 검색
zh_hant: 搜尋詞彙

source: 播放发音
en: Play Audio
ja: 発音を再生
ko: 발음 재생
zh_hant: 播放發音

source: 播放整句
en: Play Sentence
ja: 文全体を再生
ko: 문장 재생

source: 显示答案
en: Show Answer
ja: 答えを見る
ko: 답 보기
zh_hant: 顯示答案

source: 暂无出现记录
en: No occurrences found
ja: 登場記録なし
ko: 등장 기록 없음
zh_hant: 暫無出現記錄

source: 暂无词卡
en: No cards yet
ja: カードなし
ko: 카드 없음
zh_hant: 暫無詞卡

source: 暂无词汇
en: No Vocabulary Yet
ja: まだ単語がありません
ko: 아직 단어가 없습니다
zh_hant: 暫無詞彙

source: 替换（重新生成）
en: Replace (Regenerate)
ja: 置き換え（再生成）
ko: 대체 (재생성)
zh_hant: 取代（重新生成）

source: 朗读成功
en: Playback successful
ja: 再生成功
ko: 재생 성공
zh_hant: 朗讀成功

source: 朗读速度
en: Reading Speed
ja: 読み上げ速度
ko: 읽기 속도
zh_hant: 朗讀速度

source: 未配置 · 点击填写 API Key
en: Not configured · Tap to enter API Key
ja: 未設定 · タップしてAPIキーを入力
ko: 미설정 · 탭하여 API 키 입력
zh_hant: 未設定 · 點擊填寫 API Key

source: 术语
en: Term
ja: 用語
ko: 용어
zh_hant: 術語

source: 来源：%@
en: Source: %@
ja: 出典：%@
ko: 출처: %@
zh_hant: 來源：%@

source: 查看已有词卡
en: View Existing Cards
ja: 既存のカードを見る
ko: 기존 카드 보기
zh_hant: 查看已有詞卡

source: 模型（留空使用默认 deepseek-v4-flash）
en: Model (leave blank for deepseek-v4-flash)
ja: モデル（空白でdeepseek-v4-flashを使用）
ko: 모델 (비워두면 deepseek-v4-flash 사용)
zh_hant: 模型（留空使用預設 deepseek-v4-flash）

source: 模糊
en: Hard
ja: 難しい
ko: 어려움

source: 正常
en: Normal
ja: 標準
ko: 보통

source: 正文 15pt
en: Body 15pt
ja: 本文 15pt
ko: 본문 15pt

source: 深色模式
en: Dark Mode
ja: ダークモード
ko: 다크 모드

source: 生成卡片中…
en: Generating cards…
ja: カード生成中…
ko: 카드 생성 중…

source: 短语
en: Phrase
ja: フレーズ
ko: 구문
zh_hant: 短語

source: 筛选
en: Filter
ja: 絞り込み
ko: 필터
zh_hant: 篩選

source: 管理
en: Manage
ko: 관리

source: 粘贴 arXiv 链接或上传本地 PDF，词卡自动就绪。
en: Paste an arXiv link or upload a local PDF — cards are ready automatically.
ja: arXivリンクを貼り付けるかPDFをアップロード。カードが自動で準備されます。
ko: arXiv 링크를 붙여넣거나 PDF를 업로드하면 카드가 자동으로 준비됩니다.
zh_hant: 貼上 arXiv 連結或上傳本地 PDF，詞卡自動就緒。

source: 粘贴你的 API Key
en: Paste your API Key
ja: APIキーを貼り付け
ko: API 키 붙여넣기
zh_hant: 貼上你的 API Key

source: 继续保持！
en: Keep it up!
ja: その調子！
ko: 계속 유지하세요!
zh_hant: 繼續保持！

source: 解析论文内容中…
en: Parsing paper…
ja: 論文を解析中…
ko: 논문 분석 중…
zh_hant: 解析論文內容中…

source: 认识
en: Good
ja: わかる
ko: 알겠음
zh_hant: 認識

source: 论文详情
en: Paper Details
ja: 論文詳細
ko: 논문 상세
zh_hant: 論文詳情

source: 设置
en: Settings
ja: 設定
ko: 설정
zh_hant: 設定

source: 词
en: W
ja: 語
ko: 단
zh_hant: 詞

source: 词卡
en: Cards
ja: カード
ko: 카드
zh_hant: 詞卡

source: 词卡列表
en: Cards
ja: カード一覧
ko: 카드 목록
zh_hant: 詞卡列表

source: 词卡将被完全移除，请前往「导入」页面重新导入此论文。
en: All cards will be removed. Go to Import to re-import this paper.
ja: すべてのカードが削除されます。インポート画面から再インポートしてください。
ko: 모든 카드가 삭제됩니다. 가져오기 화면으로 이동하여 다시 가져오세요.
zh_hant: 詞卡將被完全移除，請前往「匯入」頁面重新匯入此論文。

source: 词卡已删除
en: Cards Deleted
ja: カードが削除されました
ko: 카드 삭제됨
zh_hant: 詞卡已刪除

source: 词卡总数
en: Total Cards
ja: カード総数
ko: 카드 합계
zh_hant: 詞卡總數

source: 词表
en: Vocab
ja: 単語帳
ko: 단어장
zh_hant: 詞表

source: 试听发音
en: Preview Voice
ja: 音声プレビュー
ko: 음성 미리 듣기
zh_hant: 試聽發音

source: 该论文已导入过
en: Paper Already Imported
ja: この論文はすでにインポート済みです
ko: 이미 가져온 논문입니다
zh_hant: 此論文已匯入過

source: 语音朗读
en: Text to Speech
ja: 音声読み上げ
ko: 음성 읽기
zh_hant: 語音朗讀

source: 语音朗读设置
en: Voice Settings
ja: 音声設定
ko: 음성 설정
zh_hant: 語音朗讀設定

source: 请前往「导入」页面重新导入此论文
en: Go to Import to re-import this paper
ja: インポート画面から再インポートしてください
ko: 가져오기 화면으로 이동하여 다시 가져오세요
zh_hant: 請前往「匯入」頁面重新匯入此論文

source: 跟随系统
en: System
ja: システムに従う
ko: 시스템 따름
zh_hant: 跟隨系統

source: 输入 API Key
en: Enter API Key
ja: APIキーを入力
ko: API 키 입력
zh_hant: 輸入 API Key

source: 返回
en: Go Back
ja: 戻る
ko: 뒤로 가기

source: 还没有导入论文
en: No papers imported yet
ja: まだ論文がありません
ko: 아직 가져온 논문이 없습니다
zh_hant: 還沒有匯入論文

source: 配置
en: Configure
ja: 設定する
ko: 설정
zh_hant: 設定

source: 配置 DashScope TTS Key 可获得更自然的发音
en: Configure DashScope TTS for more natural pronunciation
ja: DashScope TTSを設定してより自然な発音を
ko: 더 자연스러운 발음을 위해 DashScope TTS를 설정하세요
zh_hant: 設定 DashScope TTS Key 可獲得更自然的發音

source: 配置 DashScope 语音合成，在复习词卡时使用高质量 AI 发音代替系统 TTS。
en: Configure DashScope speech synthesis for high-quality AI pronunciation during card review.
ja: DashScope音声合成を設定して、カード復習時に高品質なAI発音を使用できます。
ko: 카드 복습 시 고품질 AI 발음을 위해 DashScope 음성 합성을 설정하세요.
zh_hant: 設定 DashScope 語音合成，在複習詞卡時使用高品質 AI 發音代替系統 TTS。

source: 重新导入
en: Re-import
ja: 再インポート
ko: 다시 가져오기
zh_hant: 重新匯入

source: 重新导入将删除此论文的所有词卡
en: Re-importing will delete all cards for this paper
ja: 再インポートするとすべてのカードが削除されます
ko: 다시 가져오면 이 논문의 모든 카드가 삭제됩니다
zh_hant: 重新匯入將刪除此論文的所有詞卡

source: 音色
en: Voice
ja: 声色
ko: 음색
